# SpatialElementType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialElement..::..SpatialElementType Property
SpatialElement Class See Also
---
The spatial element type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public SpatialElementType SpatialElementType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SpatialElementType As SpatialElementType
	Get
```

Visual C++
---
```text
public:
property SpatialElementType SpatialElementType {
	SpatialElementType get ();
}
```

# See Also
SpatialElement Class
Autodesk.Revit.DB Namespace